<?xml version="1.0" ?>
<net name="open-closed-eyes-002" version="11">
	<layers>
		<layer id="0" name="conv2d_input" type="Parameter" version="opset1">
			<data shape="1,96,96,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_input"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,conv2d_input,conv2d_input:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_input/Transpose([0 3 1 2])/value7321203" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_input/Transpose([0 3 1 2])/value7321203"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="conv2d_input/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential_3/conv2d/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="32" size="1728"/>
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential_3/conv2d/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/sequential_3/conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1760" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/sequential_3/conv2d/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential_3/max_pooling2d/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/max_pooling2d/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>94</dim>
					<dim>94</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dropout/Identity:0,StatefulPartitionedCall/sequential_3/max_pooling2d/MaxPool:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>47</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>47</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="1824" size="36864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>47</dim>
					<dim>47</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_1/Conv2D:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="38688" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_1/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/sequential_3/conv2d_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_1/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_1/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/sequential_3/max_pooling2d_1/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/max_pooling2d_1/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>45</dim>
					<dim>45</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dropout_1/Identity:0,StatefulPartitionedCall/sequential_3/max_pooling2d_1/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="38816" size="147456"/>
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_2/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="186272" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_2/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/sequential_3/conv2d_2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/conv2d_2/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/conv2d_2/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool/Transpose/value7001194" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="186528" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool/Transpose/value7001194"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool/Transpose"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>10</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dropout_2/Identity:0,StatefulPartitionedCall/sequential_3/max_pooling2d_2/MaxPool:0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/sequential_3/flatten/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="186560" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/flatten/Const"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/sequential_3/flatten/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/sequential_3/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/flatten/Reshape"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
					<dim>10</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/flatten/Reshape:0">
					<dim>1</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/sequential_3/dense_9/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 12800" offset="186576" size="1638400"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/sequential_3/dense_9/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_9/MatMul/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>12800</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_9/MatMul/ReadVariableOp:0">
					<dim>64</dim>
					<dim>12800</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/sequential_3/dense_9/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_9/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12800</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>12800</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_9/MatMul:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="1824976" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_9/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential_3/dense_9/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_9/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_9/Relu:0,StatefulPartitionedCall/sequential_3/dropout_3/Identity:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/sequential_3/dense_10/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="1825104" size="8192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential_3/dense_10/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_10/MatMul/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_10/MatMul/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential_3/dense_10/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_10/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_10/MatMul:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="1833296" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_10/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/sequential_3/dense_10/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_10/Relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_10/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/sequential_3/dense_11/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 64" offset="1833424" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/sequential_3/dense_11/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_11/MatMul/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_11/MatMul/ReadVariableOp:0">
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/sequential_3/dense_11/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_11/MatMul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_11/MatMul:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 2" offset="1833680" size="4"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/ReadVariableOp"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential_3/dense_11/BiasAdd:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/sequential_3/dense_11/Softmax" type="SoftMax" version="opset8">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential_3/dense_11/Softmax"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Func/StatefulPartitionedCall/output/_13:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/sequential_3/dense_11/Softmax:0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Func/StatefulPartitionedCall/output/_13:0" type="Result" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Func/StatefulPartitionedCall/output/_13:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="33" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1"/>
		<edge from-layer="33" from-port="2" to-layer="36" to-port="0"/>
		<edge from-layer="34" from-port="0" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="1"/>
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0"/>
		<edge from-layer="37" from-port="1" to-layer="40" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="0"/>
		<edge from-layer="39" from-port="1" to-layer="40" to-port="1"/>
		<edge from-layer="40" from-port="2" to-layer="43" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="1"/>
		<edge from-layer="43" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="1" to-layer="47" to-port="0"/>
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1"/>
		<edge from-layer="47" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="48" from-port="0" to-layer="49" to-port="0"/>
		<edge from-layer="49" from-port="1" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="52" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<Runtime_version value="2022.1.0-7019-cdb9bec7210-releases/2022/1"/>
		<legacy_path value="True"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<compress_fp16 value="True"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,96,96,3]"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<layout value="()"/>
			<layout_values value="{}"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="open-closed-eyes-002"/>
			<output_dir value="DIR"/>
			<packed_user_shapes value="defaultdict(&lt;class 'list'&gt;, {'conv2d_input': [{'shape': (1, 96, 96, 3), 'port': None, 'added': True}]})"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="(1, 96, 96, 3)"/>
			<progress value="True"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<source_layout value="()"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<target_layout value="()"/>
			<tensorboard_logdir value="DIR"/>
			<transform value=""/>
			<use_legacy_frontend value="False"/>
			<use_new_frontend value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_model, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_tags, scale, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
